addons/l10n_hu_edi/tests/invoice_xmls/batch_modifications.xml

<?xml version='1.0' encoding='utf-8'?>
<InvoiceData xmlns="http://schemas.nav.gov.hu/OSA/3.0/data" xmlns:ns2="http://schemas.nav.gov.hu/OSA/3.0/base">
    <invoiceNumber>1562695</invoiceNumber>
    <invoiceIssueDate>2024-11-29</invoiceIssueDate>
    <completenessIndicator>false</completenessIndicator>
    <invoiceMain>
        <batchInvoice>
            <batchIndex>1</batchIndex>
            <invoice>
                <invoiceReference>
                    <originalInvoiceNumber>1562638</originalInvoiceNumber>
                    <modifyWithoutMaster>false</modifyWithoutMaster>
                    <modificationIndex>1</modificationIndex>
                </invoiceReference>
                <invoiceHead>
                    <supplierInfo>
                        <supplierTaxNumber>
                            <ns2:taxpayerId>99938620</ns2:taxpayerId>
                        </supplierTaxNumber>
                        <supplierName>Almásy László 1</supplierName>
                        <supplierAddress>
                            <ns2:simpleAddress>
                                <ns2:countryCode>HU</ns2:countryCode>
                                <ns2:postalCode>1095</ns2:postalCode>
                                <ns2:city>BUDAPEST</ns2:city>
                                <ns2:additionalAddressDetail>Petőfi Sándor utca 1.</ns2:additionalAddressDetail>
                            </ns2:simpleAddress>
                        </supplierAddress>
                        <exciseLicenceNum>HU10140803001</exciseLicenceNum>
                    </supplierInfo>
                    <customerInfo>
                        <customerVatStatus>DOMESTIC</customerVatStatus>
                        <customerVatData>
                            <customerTaxNumber>
                                <ns2:taxpayerId>99995764</ns2:taxpayerId>
                            </customerTaxNumber>
                        </customerVatData>
                        <customerName>,Kaiser Éva</customerName>
                        <customerAddress>
                            <ns2:simpleAddress>
                                <ns2:countryCode>HU</ns2:countryCode>
                                <ns2:postalCode>2074</ns2:postalCode>
                                <ns2:city>Perbál</ns2:city>
                                <ns2:additionalAddressDetail>Szabadság u.38.</ns2:additionalAddressDetail>
                            </ns2:simpleAddress>
                        </customerAddress>
                    </customerInfo>
                    <invoiceDetail>
                        <invoiceCategory>NORMAL</invoiceCategory>
                        <invoiceDeliveryDate>2024-11-29</invoiceDeliveryDate>
                        <currencyCode>HUF</currencyCode>
                        <exchangeRate>1</exchangeRate>
                        <paymentMethod>TRANSFER</paymentMethod>
                        <paymentDate>2024-12-20</paymentDate>
                        <invoiceAppearance>PAPER</invoiceAppearance>
                    </invoiceDetail>
                </invoiceHead>
                <invoiceLines>
                    <mergedItemIndicator>false</mergedItemIndicator>
                    <line>
                        <lineNumber>1</lineNumber>
                        <lineModificationReference>
                            <lineNumberReference>26</lineNumberReference>
                            <lineOperation>CREATE</lineOperation>
                        </lineModificationReference>
                        <productCodes>
                            <productCode>
                                <productCodeCategory>KN</productCodeCategory>
                                <productCodeValue>22030009</productCodeValue>
                            </productCode>
                        </productCodes>
                        <lineExpressionIndicator>true</lineExpressionIndicator>
                        <lineDescription>Murrumbidgee 17</lineDescription>
                        <quantity>-24</quantity>
                        <unitOfMeasure>PIECE</unitOfMeasure>
                        <unitPrice>198.02</unitPrice>
                        <lineAmountsNormal>
                            <lineNetAmountData>
                                <lineNetAmount>-4752.48</lineNetAmount>
                                <lineNetAmountHUF>-4752.48</lineNetAmountHUF>
                            </lineNetAmountData>
                            <lineVatRate>
                                <vatPercentage>0.27</vatPercentage>
                            </lineVatRate>
                            <lineVatData>
                                <lineVatAmount>-1283.17</lineVatAmount>
                                <lineVatAmountHUF>-1283.17</lineVatAmountHUF>
                            </lineVatData>
                            <lineGrossAmountData>
                                <lineGrossAmountNormal>-6035.65</lineGrossAmountNormal>
                                <lineGrossAmountNormalHUF>-6035.65</lineGrossAmountNormalHUF>
                            </lineGrossAmountData>
                        </lineAmountsNormal>
                    </line>
                </invoiceLines>
                <invoiceSummary>
                    <summaryNormal>
                        <summaryByVatRate>
                            <vatRate>
                                <vatPercentage>0.27</vatPercentage>
                            </vatRate>
                            <vatRateNetData>
                                <vatRateNetAmount>-4752.48</vatRateNetAmount>
                                <vatRateNetAmountHUF>-4752.48</vatRateNetAmountHUF>
                            </vatRateNetData>
                            <vatRateVatData>
                                <vatRateVatAmount>-1283</vatRateVatAmount>
                                <vatRateVatAmountHUF>-1283</vatRateVatAmountHUF>
                            </vatRateVatData>
                            <vatRateGrossData>
                                <vatRateGrossAmount>-6035.48</vatRateGrossAmount>
                                <vatRateGrossAmountHUF>-6035.48</vatRateGrossAmountHUF>
                            </vatRateGrossData>
                        </summaryByVatRate>
                        <invoiceNetAmount>-4752</invoiceNetAmount>
                        <invoiceNetAmountHUF>-4752</invoiceNetAmountHUF>
                        <invoiceVatAmount>-1283</invoiceVatAmount>
                        <invoiceVatAmountHUF>-1283</invoiceVatAmountHUF>
                    </summaryNormal>
                    <summaryGrossData>
                        <invoiceGrossAmount>-6035</invoiceGrossAmount>
                        <invoiceGrossAmountHUF>-6035</invoiceGrossAmountHUF>
                    </summaryGrossData>
                </invoiceSummary>
            </invoice>
        </batchInvoice>
        <batchInvoice>
            <batchIndex>2</batchIndex>
            <invoice>
                <invoiceReference>
                    <originalInvoiceNumber>1562639</originalInvoiceNumber>
                    <modifyWithoutMaster>false</modifyWithoutMaster>
                    <modificationIndex>1</modificationIndex>
                </invoiceReference>
                <invoiceHead>
                    <supplierInfo>
                        <supplierTaxNumber>
                            <ns2:taxpayerId>99938620</ns2:taxpayerId>
                        </supplierTaxNumber>
                        <supplierName>Almásy László 1</supplierName>
                        <supplierAddress>
                            <ns2:simpleAddress>
                                <ns2:countryCode>HU</ns2:countryCode>
                                <ns2:postalCode>1095</ns2:postalCode>
                                <ns2:city>BUDAPEST</ns2:city>
                                <ns2:additionalAddressDetail>Petőfi Sándor utca 1.</ns2:additionalAddressDetail>
                            </ns2:simpleAddress>
                        </supplierAddress>
                        <exciseLicenceNum>HU10140803001</exciseLicenceNum>
                    </supplierInfo>
                    <customerInfo>
                        <customerVatStatus>DOMESTIC</customerVatStatus>
                        <customerVatData>
                            <customerTaxNumber>
                                <ns2:taxpayerId>99995764</ns2:taxpayerId>
                            </customerTaxNumber>
                        </customerVatData>
                        <customerName>,Kaiser Éva</customerName>
                        <customerAddress>
                            <ns2:simpleAddress>
                                <ns2:countryCode>HU</ns2:countryCode>
                                <ns2:postalCode>2074</ns2:postalCode>
                                <ns2:city>Perbál</ns2:city>
                                <ns2:additionalAddressDetail>Szabadság u.38.</ns2:additionalAddressDetail>
                            </ns2:simpleAddress>
                        </customerAddress>
                    </customerInfo>
                    <invoiceDetail>
                        <invoiceCategory>NORMAL</invoiceCategory>
                        <invoiceDeliveryDate>2024-11-29</invoiceDeliveryDate>
                        <currencyCode>HUF</currencyCode>
                        <exchangeRate>1</exchangeRate>
                        <paymentMethod>TRANSFER</paymentMethod>
                        <paymentDate>2024-12-20</paymentDate>
                        <invoiceAppearance>PAPER</invoiceAppearance>
                    </invoiceDetail>
                </invoiceHead>
                <invoiceLines>
                    <mergedItemIndicator>false</mergedItemIndicator>
                    <line>
                        <lineNumber>1</lineNumber>
                        <lineModificationReference>
                            <lineNumberReference>31</lineNumberReference>
                            <lineOperation>CREATE</lineOperation>
                        </lineModificationReference>
                        <productCodes>
                            <productCode>
                                <productCodeCategory>KN</productCodeCategory>
                                <productCodeValue>00927212</productCodeValue>
                            </productCode>
                        </productCodes>
                        <lineExpressionIndicator>true</lineExpressionIndicator>
                        <lineDescription>Delaware 19</lineDescription>
                        <quantity>-6</quantity>
                        <unitOfMeasure>PIECE</unitOfMeasure>
                        <unitPrice>50</unitPrice>
                        <lineAmountsNormal>
                            <lineNetAmountData>
                                <lineNetAmount>-300</lineNetAmount>
                                <lineNetAmountHUF>-300</lineNetAmountHUF>
                            </lineNetAmountData>
                            <lineVatRate>
                                <vatOutOfScope>
                                    <case>ATK</case>
                                    <reason>Áfa tv. 2-3. §</reason>
                                </vatOutOfScope>
                            </lineVatRate>
                            <lineVatData>
                                <lineVatAmount>0</lineVatAmount>
                                <lineVatAmountHUF>0</lineVatAmountHUF>
                            </lineVatData>
                            <lineGrossAmountData>
                                <lineGrossAmountNormal>-300</lineGrossAmountNormal>
                                <lineGrossAmountNormalHUF>-300</lineGrossAmountNormalHUF>
                            </lineGrossAmountData>
                        </lineAmountsNormal>
                    </line>
                    <line>
                        <lineNumber>2</lineNumber>
                        <lineModificationReference>
                            <lineNumberReference>32</lineNumberReference>
                            <lineOperation>CREATE</lineOperation>
                        </lineModificationReference>
                        <productCodes>
                            <productCode>
                                <productCodeCategory>KN</productCodeCategory>
                                <productCodeValue>00927212</productCodeValue>
                            </productCode>
                        </productCodes>
                        <lineExpressionIndicator>true</lineExpressionIndicator>
                        <lineDescription>Delaware 19</lineDescription>
                        <quantity>-12</quantity>
                        <unitOfMeasure>PIECE</unitOfMeasure>
                        <unitPrice>50</unitPrice>
                        <lineAmountsNormal>
                            <lineNetAmountData>
                                <lineNetAmount>-600</lineNetAmount>
                                <lineNetAmountHUF>-600</lineNetAmountHUF>
                            </lineNetAmountData>
                            <lineVatRate>
                                <vatOutOfScope>
                                    <case>ATK</case>
                                    <reason>Áfa tv. 2-3. §</reason>
                                </vatOutOfScope>
                            </lineVatRate>
                            <lineVatData>
                                <lineVatAmount>0</lineVatAmount>
                                <lineVatAmountHUF>0</lineVatAmountHUF>
                            </lineVatData>
                            <lineGrossAmountData>
                                <lineGrossAmountNormal>-600</lineGrossAmountNormal>
                                <lineGrossAmountNormalHUF>-600</lineGrossAmountNormalHUF>
                            </lineGrossAmountData>
                        </lineAmountsNormal>
                    </line>
                    <line>
                        <lineNumber>3</lineNumber>
                        <lineModificationReference>
                            <lineNumberReference>33</lineNumberReference>
                            <lineOperation>CREATE</lineOperation>
                        </lineModificationReference>
                        <productCodes>
                            <productCode>
                                <productCodeCategory>KN</productCodeCategory>
                                <productCodeValue>00927212</productCodeValue>
                            </productCode>
                        </productCodes>
                        <lineExpressionIndicator>true</lineExpressionIndicator>
                        <lineDescription>Delaware 19</lineDescription>
                        <quantity>-6</quantity>
                        <unitOfMeasure>PIECE</unitOfMeasure>
                        <unitPrice>50</unitPrice>
                        <lineAmountsNormal>
                            <lineNetAmountData>
                                <lineNetAmount>-300</lineNetAmount>
                                <lineNetAmountHUF>-300</lineNetAmountHUF>
                            </lineNetAmountData>
                            <lineVatRate>
                                <vatOutOfScope>
                                    <case>ATK</case>
                                    <reason>Áfa tv. 2-3. §</reason>
                                </vatOutOfScope>
                            </lineVatRate>
                            <lineVatData>
                                <lineVatAmount>0</lineVatAmount>
                                <lineVatAmountHUF>0</lineVatAmountHUF>
                            </lineVatData>
                            <lineGrossAmountData>
                                <lineGrossAmountNormal>-300</lineGrossAmountNormal>
                                <lineGrossAmountNormalHUF>-300</lineGrossAmountNormalHUF>
                            </lineGrossAmountData>
                        </lineAmountsNormal>
                    </line>
                </invoiceLines>
                <invoiceSummary>
                    <summaryNormal>
                        <summaryByVatRate>
                            <vatRate>
                                <vatOutOfScope>
                                    <case>ATK</case>
                                    <reason>Áfa tv. 2-3. §</reason>
                                </vatOutOfScope>
                            </vatRate>
                            <vatRateNetData>
                                <vatRateNetAmount>-1200</vatRateNetAmount>
                                <vatRateNetAmountHUF>-1200</vatRateNetAmountHUF>
                            </vatRateNetData>
                            <vatRateVatData>
                                <vatRateVatAmount>0</vatRateVatAmount>
                                <vatRateVatAmountHUF>0</vatRateVatAmountHUF>
                            </vatRateVatData>
                            <vatRateGrossData>
                                <vatRateGrossAmount>-1200</vatRateGrossAmount>
                                <vatRateGrossAmountHUF>-1200</vatRateGrossAmountHUF>
                            </vatRateGrossData>
                        </summaryByVatRate>
                        <invoiceNetAmount>-1200</invoiceNetAmount>
                        <invoiceNetAmountHUF>-1200</invoiceNetAmountHUF>
                        <invoiceVatAmount>0</invoiceVatAmount>
                        <invoiceVatAmountHUF>0</invoiceVatAmountHUF>
                    </summaryNormal>
                    <summaryGrossData>
                        <invoiceGrossAmount>-1200</invoiceGrossAmount>
                        <invoiceGrossAmountHUF>-1200</invoiceGrossAmountHUF>
                    </summaryGrossData>
                </invoiceSummary>
            </invoice>
        </batchInvoice>
    </invoiceMain>
</InvoiceData>
