addons/l10n_hu_edi/tests/invoice_xmls/debit_note.xml

<?xml version='1.0' encoding='utf-8'?>
<InvoiceData xmlns="http://schemas.nav.gov.hu/OSA/3.0/data" xmlns:ns2="http://schemas.nav.gov.hu/OSA/3.0/base">
    <invoiceNumber>2024/CT24029272</invoiceNumber>
    <invoiceIssueDate>2024-09-19</invoiceIssueDate>
    <completenessIndicator>false</completenessIndicator>
    <invoiceMain>
        <invoice>
            <invoiceReference>
                <originalInvoiceNumber>2024/CT24029201</originalInvoiceNumber>
                <modifyWithoutMaster>false</modifyWithoutMaster>
                <modificationIndex>1</modificationIndex>
            </invoiceReference>
            <invoiceHead>
                <supplierInfo>
                    <supplierTaxNumber>
                        <ns2:taxpayerId>99999394</ns2:taxpayerId>
                        <ns2:vatCode>2</ns2:vatCode>
                        <ns2:countyCode>44</ns2:countyCode>
                    </supplierTaxNumber>
                    <supplierName>Hadik András 2</supplierName>
                    <supplierAddress>
                        <ns2:simpleAddress>
                            <ns2:countryCode>HU</ns2:countryCode>
                            <ns2:postalCode>2045</ns2:postalCode>
                            <ns2:city>TÖRÖKBÁLINT</ns2:city>
                            <ns2:additionalAddressDetail>Petőfi Sándor utca 1.</ns2:additionalAddressDetail>
                        </ns2:simpleAddress>
                    </supplierAddress>
                </supplierInfo>
                <customerInfo>
                    <customerVatStatus>DOMESTIC</customerVatStatus>
                    <customerVatData>
                        <customerTaxNumber>
                            <ns2:taxpayerId>99995764</ns2:taxpayerId>
                            <ns2:vatCode>2</ns2:vatCode>
                            <ns2:countyCode>33</ns2:countyCode>
                        </customerTaxNumber>
                    </customerVatData>
                    <customerName>KAISER ÉVA</customerName>
                    <customerAddress>
                        <ns2:simpleAddress>
                            <ns2:countryCode>HU</ns2:countryCode>
                            <ns2:postalCode>2074</ns2:postalCode>
                            <ns2:city>PERBÁL</ns2:city>
                            <ns2:additionalAddressDetail>SZABADSÁG U. 38.</ns2:additionalAddressDetail>
                        </ns2:simpleAddress>
                    </customerAddress>
                </customerInfo>
                <invoiceDetail>
                    <invoiceCategory>NORMAL</invoiceCategory>
                    <invoiceDeliveryDate>2024-09-20</invoiceDeliveryDate>
                    <currencyCode>HUF</currencyCode>
                    <exchangeRate>1</exchangeRate>
                    <invoiceAppearance>PAPER</invoiceAppearance>
                </invoiceDetail>
            </invoiceHead>
            <invoiceLines>
                <mergedItemIndicator>false</mergedItemIndicator>
                <line>
                    <lineNumber>1</lineNumber>
                    <lineModificationReference>
                        <lineNumberReference>9</lineNumberReference>
                        <lineOperation>CREATE</lineOperation>
                    </lineModificationReference>
                    <lineExpressionIndicator>true</lineExpressionIndicator>
                    <lineDescription>Nile 15</lineDescription>
                    <quantity>24</quantity>
                    <unitOfMeasure>PIECE</unitOfMeasure>
                    <unitPrice>50</unitPrice>
                    <unitPriceHUF>50</unitPriceHUF>
                    <lineAmountsNormal>
                        <lineNetAmountData>
                            <lineNetAmount>1200</lineNetAmount>
                            <lineNetAmountHUF>1200</lineNetAmountHUF>
                        </lineNetAmountData>
                        <lineVatRate>
                            <vatOutOfScope>
                                <case>ATK</case>
                                <reason>Áfa tárgyi hatályán kívül</reason>
                            </vatOutOfScope>
                        </lineVatRate>
                        <lineVatData>
                            <lineVatAmount>0</lineVatAmount>
                            <lineVatAmountHUF>0</lineVatAmountHUF>
                        </lineVatData>
                        <lineGrossAmountData>
                            <lineGrossAmountNormal>1200</lineGrossAmountNormal>
                            <lineGrossAmountNormalHUF>1200</lineGrossAmountNormalHUF>
                        </lineGrossAmountData>
                    </lineAmountsNormal>
                </line>
                <line>
                    <lineNumber>2</lineNumber>
                    <lineModificationReference>
                        <lineNumberReference>10</lineNumberReference>
                        <lineOperation>CREATE</lineOperation>
                    </lineModificationReference>
                    <lineExpressionIndicator>true</lineExpressionIndicator>
                    <lineDescription>Euphrates 17</lineDescription>
                    <quantity>24</quantity>
                    <unitOfMeasure>PIECE</unitOfMeasure>
                    <unitPrice>335.291667</unitPrice>
                    <unitPriceHUF>335.291667</unitPriceHUF>
                    <lineAmountsNormal>
                        <lineNetAmountData>
                            <lineNetAmount>8047</lineNetAmount>
                            <lineNetAmountHUF>8047</lineNetAmountHUF>
                        </lineNetAmountData>
                        <lineVatRate>
                            <vatPercentage>0.27</vatPercentage>
                        </lineVatRate>
                        <lineVatData>
                            <lineVatAmount>2172.69</lineVatAmount>
                            <lineVatAmountHUF>2172.69</lineVatAmountHUF>
                        </lineVatData>
                        <lineGrossAmountData>
                            <lineGrossAmountNormal>10219.69</lineGrossAmountNormal>
                            <lineGrossAmountNormalHUF>10219.69</lineGrossAmountNormalHUF>
                        </lineGrossAmountData>
                    </lineAmountsNormal>
                </line>
                <line>
                    <lineNumber>3</lineNumber>
                    <lineModificationReference>
                        <lineNumberReference>11</lineNumberReference>
                        <lineOperation>CREATE</lineOperation>
                    </lineModificationReference>
                    <lineExpressionIndicator>true</lineExpressionIndicator>
                    <lineDescription>Po 34</lineDescription>
                    <quantity>-24</quantity>
                    <unitOfMeasure>PIECE</unitOfMeasure>
                    <unitPrice>335.291667</unitPrice>
                    <unitPriceHUF>335.291667</unitPriceHUF>
                    <lineAmountsNormal>
                        <lineNetAmountData>
                            <lineNetAmount>-8047</lineNetAmount>
                            <lineNetAmountHUF>-8047</lineNetAmountHUF>
                        </lineNetAmountData>
                        <lineVatRate>
                            <vatPercentage>0.27</vatPercentage>
                        </lineVatRate>
                        <lineVatData>
                            <lineVatAmount>-2172.69</lineVatAmount>
                            <lineVatAmountHUF>-2172.69</lineVatAmountHUF>
                        </lineVatData>
                        <lineGrossAmountData>
                            <lineGrossAmountNormal>-10219.69</lineGrossAmountNormal>
                            <lineGrossAmountNormalHUF>-10219.69</lineGrossAmountNormalHUF>
                        </lineGrossAmountData>
                    </lineAmountsNormal>
                </line>
            </invoiceLines>
            <invoiceSummary>
                <summaryNormal>
                    <summaryByVatRate>
                        <vatRate>
                            <vatOutOfScope>
                                <case>ATK</case>
                                <reason>Áfa tárgyi hatályán kívül</reason>
                            </vatOutOfScope>
                        </vatRate>
                        <vatRateNetData>
                            <vatRateNetAmount>1200</vatRateNetAmount>
                            <vatRateNetAmountHUF>1200</vatRateNetAmountHUF>
                        </vatRateNetData>
                        <vatRateVatData>
                            <vatRateVatAmount>0</vatRateVatAmount>
                            <vatRateVatAmountHUF>0</vatRateVatAmountHUF>
                        </vatRateVatData>
                        <vatRateGrossData>
                            <vatRateGrossAmount>1200</vatRateGrossAmount>
                            <vatRateGrossAmountHUF>1200</vatRateGrossAmountHUF>
                        </vatRateGrossData>
                    </summaryByVatRate>
                    <summaryByVatRate>
                        <vatRate>
                            <vatPercentage>0.27</vatPercentage>
                        </vatRate>
                        <vatRateNetData>
                            <vatRateNetAmount>0</vatRateNetAmount>
                            <vatRateNetAmountHUF>0</vatRateNetAmountHUF>
                        </vatRateNetData>
                        <vatRateVatData>
                            <vatRateVatAmount>0</vatRateVatAmount>
                            <vatRateVatAmountHUF>0</vatRateVatAmountHUF>
                        </vatRateVatData>
                        <vatRateGrossData>
                            <vatRateGrossAmount>0</vatRateGrossAmount>
                            <vatRateGrossAmountHUF>0</vatRateGrossAmountHUF>
                        </vatRateGrossData>
                    </summaryByVatRate>
                    <invoiceNetAmount>1200</invoiceNetAmount>
                    <invoiceNetAmountHUF>1200</invoiceNetAmountHUF>
                    <invoiceVatAmount>0</invoiceVatAmount>
                    <invoiceVatAmountHUF>0</invoiceVatAmountHUF>
                </summaryNormal>
                <summaryGrossData>
                    <invoiceGrossAmount>1200</invoiceGrossAmount>
                    <invoiceGrossAmountHUF>1200</invoiceGrossAmountHUF>
                </summaryGrossData>
            </invoiceSummary>
        </invoice>
    </invoiceMain>
</InvoiceData>
