addons/l10n_hu_edi/tests/invoice_xmls/normal_invoice.xml

<?xml version='1.0' encoding='utf-8'?>
<InvoiceData xmlns="http://schemas.nav.gov.hu/OSA/3.0/data" xmlns:ns2="http://schemas.nav.gov.hu/OSA/3.0/base">
    <invoiceNumber>2023/CT23026441</invoiceNumber>
    <invoiceIssueDate>2023-08-17</invoiceIssueDate>
    <completenessIndicator>false</completenessIndicator>
    <invoiceMain>
        <invoice>
            <invoiceHead>
                <supplierInfo>
                    <supplierTaxNumber>
                        <ns2:taxpayerId>99999394</ns2:taxpayerId>
                        <ns2:vatCode>2</ns2:vatCode>
                        <ns2:countyCode>44</ns2:countyCode>
                    </supplierTaxNumber>
                    <groupMemberTaxNumber>
                        <ns2:taxpayerId>99909032</ns2:taxpayerId>
                    </groupMemberTaxNumber>
                    <supplierName>Hadik András 2</supplierName>
                    <supplierAddress>
                        <ns2:simpleAddress>
                            <ns2:countryCode>HU</ns2:countryCode>
                            <ns2:postalCode>2045</ns2:postalCode>
                            <ns2:city>TÖRÖKBÁLINT</ns2:city>
                            <ns2:additionalAddressDetail>Petőfi Sándor utca 1.</ns2:additionalAddressDetail>
                        </ns2:simpleAddress>
                    </supplierAddress>
                </supplierInfo>
                <customerInfo>
                    <customerVatStatus>DOMESTIC</customerVatStatus>
                    <customerVatData>
                        <customerTaxNumber>
                            <ns2:taxpayerId>99995764</ns2:taxpayerId>
                            <ns2:vatCode>2</ns2:vatCode>
                            <ns2:countyCode>33</ns2:countyCode>
                        </customerTaxNumber>
                    </customerVatData>
                    <customerName>KAISER ÉVA</customerName>
                    <customerAddress>
                        <ns2:simpleAddress>
                            <ns2:countryCode>HU</ns2:countryCode>
                            <ns2:postalCode>2074</ns2:postalCode>
                            <ns2:city>PERBÁL</ns2:city>
                            <ns2:additionalAddressDetail>SZABADSÁG U. 38.</ns2:additionalAddressDetail>
                        </ns2:simpleAddress>
                    </customerAddress>
                </customerInfo>
                <invoiceDetail>
                    <invoiceCategory>NORMAL</invoiceCategory>
                    <invoiceDeliveryDate>2023-08-18</invoiceDeliveryDate>
                    <currencyCode>HUF</currencyCode>
                    <exchangeRate>1</exchangeRate>
                    <invoiceAppearance>PAPER</invoiceAppearance>
                </invoiceDetail>
            </invoiceHead>
            <invoiceLines>
                <mergedItemIndicator>false</mergedItemIndicator>
                <line>
                    <lineNumber>1</lineNumber>
                    <lineExpressionIndicator>true</lineExpressionIndicator>
                    <lineDescription>Uruguay 22</lineDescription>
                    <quantity>48</quantity>
                    <unitOfMeasure>PIECE</unitOfMeasure>
                    <unitPrice>136.708333</unitPrice>
                    <unitPriceHUF>136.708333</unitPriceHUF>
                    <lineAmountsNormal>
                        <lineNetAmountData>
                            <lineNetAmount>6562</lineNetAmount>
                            <lineNetAmountHUF>6562</lineNetAmountHUF>
                        </lineNetAmountData>
                        <lineVatRate>
                            <vatPercentage>0.27</vatPercentage>
                        </lineVatRate>
                        <lineVatData>
                            <lineVatAmount>1771.74</lineVatAmount>
                            <lineVatAmountHUF>1771.74</lineVatAmountHUF>
                        </lineVatData>
                        <lineGrossAmountData>
                            <lineGrossAmountNormal>8333.74</lineGrossAmountNormal>
                            <lineGrossAmountNormalHUF>8333.74</lineGrossAmountNormalHUF>
                        </lineGrossAmountData>
                    </lineAmountsNormal>
                </line>
                <line>
                    <lineNumber>2</lineNumber>
                    <lineExpressionIndicator>true</lineExpressionIndicator>
                    <lineDescription>Irtysh 11</lineDescription>
                    <quantity>120</quantity>
                    <unitOfMeasure>PIECE</unitOfMeasure>
                    <unitPrice>182.541667</unitPrice>
                    <unitPriceHUF>182.541667</unitPriceHUF>
                    <lineAmountsNormal>
                        <lineNetAmountData>
                            <lineNetAmount>21905</lineNetAmount>
                            <lineNetAmountHUF>21905</lineNetAmountHUF>
                        </lineNetAmountData>
                        <lineVatRate>
                            <vatPercentage>0.27</vatPercentage>
                        </lineVatRate>
                        <lineVatData>
                            <lineVatAmount>5914.35</lineVatAmount>
                            <lineVatAmountHUF>5914.35</lineVatAmountHUF>
                        </lineVatData>
                        <lineGrossAmountData>
                            <lineGrossAmountNormal>27819.35</lineGrossAmountNormal>
                            <lineGrossAmountNormalHUF>27819.35</lineGrossAmountNormalHUF>
                        </lineGrossAmountData>
                    </lineAmountsNormal>
                </line>
                <line>
                    <lineNumber>3</lineNumber>
                    <lineExpressionIndicator>true</lineExpressionIndicator>
                    <lineDescription>Taieri 12</lineDescription>
                    <quantity>1</quantity>
                    <unitOfMeasure>PIECE</unitOfMeasure>
                    <unitPrice>1200</unitPrice>
                    <unitPriceHUF>1200</unitPriceHUF>
                    <lineAmountsNormal>
                        <lineNetAmountData>
                            <lineNetAmount>1200</lineNetAmount>
                            <lineNetAmountHUF>1200</lineNetAmountHUF>
                        </lineNetAmountData>
                        <lineVatRate>
                            <vatPercentage>0.27</vatPercentage>
                        </lineVatRate>
                        <lineVatData>
                            <lineVatAmount>324</lineVatAmount>
                            <lineVatAmountHUF>324</lineVatAmountHUF>
                        </lineVatData>
                        <lineGrossAmountData>
                            <lineGrossAmountNormal>1524</lineGrossAmountNormal>
                            <lineGrossAmountNormalHUF>1524</lineGrossAmountNormalHUF>
                        </lineGrossAmountData>
                    </lineAmountsNormal>
                </line>
                <line>
                    <lineNumber>4</lineNumber>
                    <lineExpressionIndicator>true</lineExpressionIndicator>
                    <lineDescription>Cocytus 12</lineDescription>
                    <quantity>1</quantity>
                    <unitOfMeasure>PIECE</unitOfMeasure>
                    <unitPrice>0</unitPrice>
                    <unitPriceHUF>0</unitPriceHUF>
                    <lineAmountsNormal>
                        <lineNetAmountData>
                            <lineNetAmount>0</lineNetAmount>
                            <lineNetAmountHUF>0</lineNetAmountHUF>
                        </lineNetAmountData>
                        <lineVatRate>
                            <vatPercentage>0.27</vatPercentage>
                        </lineVatRate>
                        <lineVatData>
                            <lineVatAmount>-0.09</lineVatAmount>
                            <lineVatAmountHUF>-0.09</lineVatAmountHUF>
                        </lineVatData>
                        <lineGrossAmountData>
                            <lineGrossAmountNormal>-0.09</lineGrossAmountNormal>
                            <lineGrossAmountNormalHUF>-0.09</lineGrossAmountNormalHUF>
                        </lineGrossAmountData>
                    </lineAmountsNormal>
                </line>
            </invoiceLines>
            <invoiceSummary>
                <summaryNormal>
                    <summaryByVatRate>
                        <vatRate>
                            <vatPercentage>0.27</vatPercentage>
                        </vatRate>
                        <vatRateNetData>
                            <vatRateNetAmount>29667</vatRateNetAmount>
                            <vatRateNetAmountHUF>29667</vatRateNetAmountHUF>
                        </vatRateNetData>
                        <vatRateVatData>
                            <vatRateVatAmount>8010</vatRateVatAmount>
                            <vatRateVatAmountHUF>8010</vatRateVatAmountHUF>
                        </vatRateVatData>
                        <vatRateGrossData>
                            <vatRateGrossAmount>37677</vatRateGrossAmount>
                            <vatRateGrossAmountHUF>37677</vatRateGrossAmountHUF>
                        </vatRateGrossData>
                    </summaryByVatRate>
                    <invoiceNetAmount>29667</invoiceNetAmount>
                    <invoiceNetAmountHUF>29667</invoiceNetAmountHUF>
                    <invoiceVatAmount>8010</invoiceVatAmount>
                    <invoiceVatAmountHUF>8010</invoiceVatAmountHUF>
                </summaryNormal>
                <summaryGrossData>
                    <invoiceGrossAmount>37677</invoiceGrossAmount>
                    <invoiceGrossAmountHUF>37677</invoiceGrossAmountHUF>
                </summaryGrossData>
            </invoiceSummary>
        </invoice>
    </invoiceMain>
</InvoiceData>
