addons/l10n_hu_edi/tests/invoice_xmls/simplified_invoice.xml

<?xml version='1.0' encoding='utf-8'?>
<InvoiceData xmlns="http://schemas.nav.gov.hu/OSA/3.0/data" xmlns:ns2="http://schemas.nav.gov.hu/OSA/3.0/base">
    <invoiceNumber>A06600324/1285/00009</invoiceNumber>
    <invoiceIssueDate>2023-01-27</invoiceIssueDate>
    <completenessIndicator>false</completenessIndicator>
    <invoiceMain>
        <invoice>
            <invoiceHead>
                <supplierInfo>
                    <supplierTaxNumber>
                        <ns2:taxpayerId>99943339</ns2:taxpayerId>
                    </supplierTaxNumber>
                    <supplierName>Jurisics Miklós</supplierName>
                    <supplierAddress>
                        <ns2:detailedAddress>
                            <ns2:countryCode>HU</ns2:countryCode>
                            <ns2:postalCode>1097</ns2:postalCode>
                            <ns2:city>BUDAPEST</ns2:city>
                            <ns2:streetName>Petőfi Sándor</ns2:streetName>
                            <ns2:publicPlaceCategory>KÖRÚT</ns2:publicPlaceCategory>
                            <ns2:number>1.</ns2:number>
                        </ns2:detailedAddress>
                    </supplierAddress>
                </supplierInfo>
                <customerInfo>
                    <customerVatStatus>DOMESTIC</customerVatStatus>
                    <customerVatData>
                        <customerTaxNumber>
                            <ns2:taxpayerId>99951823</ns2:taxpayerId>
                        </customerTaxNumber>
                    </customerVatData>
                    <customerName>RENT AND RENT KFT</customerName>
                    <customerAddress>
                        <ns2:detailedAddress>
                            <ns2:countryCode>HU</ns2:countryCode>
                            <ns2:postalCode>2074</ns2:postalCode>
                            <ns2:city>PERBÁL</ns2:city>
                            <ns2:streetName>SZABADSÁG U 38</ns2:streetName>
                            <ns2:publicPlaceCategory>-</ns2:publicPlaceCategory>
                            <ns2:number>-</ns2:number>
                        </ns2:detailedAddress>
                    </customerAddress>
                </customerInfo>
                <invoiceDetail>
                    <invoiceCategory>SIMPLIFIED</invoiceCategory>
                    <invoiceDeliveryDate>2023-01-27</invoiceDeliveryDate>
                    <currencyCode>HUF</currencyCode>
                    <exchangeRate>1</exchangeRate>
                    <invoiceAppearance>PAPER</invoiceAppearance>
                </invoiceDetail>
            </invoiceHead>
            <invoiceLines>
                <mergedItemIndicator>false</mergedItemIndicator>
                <line>
                    <lineNumber>1</lineNumber>
                    <lineExpressionIndicator>true</lineExpressionIndicator>
                    <lineDescription>Jubba 31</lineDescription>
                    <quantity>1</quantity>
                    <unitOfMeasure>PIECE</unitOfMeasure>
                    <unitPrice>4799</unitPrice>
                    <unitPriceHUF>4799</unitPriceHUF>
                    <lineAmountsSimplified>
                        <lineVatRate>
                            <vatContent>0.2126</vatContent>
                        </lineVatRate>
                        <lineGrossAmountSimplified>4799</lineGrossAmountSimplified>
                        <lineGrossAmountSimplifiedHUF>4799</lineGrossAmountSimplifiedHUF>
                    </lineAmountsSimplified>
                </line>
                <line>
                    <lineNumber>2</lineNumber>
                    <lineExpressionIndicator>true</lineExpressionIndicator>
                    <lineDescription>Nelson 23</lineDescription>
                    <quantity>2</quantity>
                    <unitOfMeasure>PIECE</unitOfMeasure>
                    <unitPrice>6499</unitPrice>
                    <unitPriceHUF>6499</unitPriceHUF>
                    <lineAmountsSimplified>
                        <lineVatRate>
                            <vatContent>0.2126</vatContent>
                        </lineVatRate>
                        <lineGrossAmountSimplified>12998</lineGrossAmountSimplified>
                        <lineGrossAmountSimplifiedHUF>12998</lineGrossAmountSimplifiedHUF>
                    </lineAmountsSimplified>
                </line>
                <line>
                    <lineNumber>3</lineNumber>
                    <lineExpressionIndicator>true</lineExpressionIndicator>
                    <lineDescription>Daugava 16</lineDescription>
                    <quantity>1</quantity>
                    <unitOfMeasure>PIECE</unitOfMeasure>
                    <unitPrice>999</unitPrice>
                    <unitPriceHUF>999</unitPriceHUF>
                    <lineAmountsSimplified>
                        <lineVatRate>
                            <vatContent>0.2126</vatContent>
                        </lineVatRate>
                        <lineGrossAmountSimplified>999</lineGrossAmountSimplified>
                        <lineGrossAmountSimplifiedHUF>999</lineGrossAmountSimplifiedHUF>
                    </lineAmountsSimplified>
                </line>
                <line>
                    <lineNumber>4</lineNumber>
                    <lineExpressionIndicator>true</lineExpressionIndicator>
                    <lineDescription>Daugava 16</lineDescription>
                    <quantity>1</quantity>
                    <unitOfMeasure>PIECE</unitOfMeasure>
                    <unitPrice>799</unitPrice>
                    <unitPriceHUF>799</unitPriceHUF>
                    <lineAmountsSimplified>
                        <lineVatRate>
                            <vatContent>0.2126</vatContent>
                        </lineVatRate>
                        <lineGrossAmountSimplified>799</lineGrossAmountSimplified>
                        <lineGrossAmountSimplifiedHUF>799</lineGrossAmountSimplifiedHUF>
                    </lineAmountsSimplified>
                </line>
                <line>
                    <lineNumber>5</lineNumber>
                    <lineExpressionIndicator>true</lineExpressionIndicator>
                    <lineDescription>Kolyma 26</lineDescription>
                    <quantity>1</quantity>
                    <unitOfMeasure>PIECE</unitOfMeasure>
                    <unitPrice>2199</unitPrice>
                    <unitPriceHUF>2199</unitPriceHUF>
                    <lineAmountsSimplified>
                        <lineVatRate>
                            <vatContent>0.2126</vatContent>
                        </lineVatRate>
                        <lineGrossAmountSimplified>2199</lineGrossAmountSimplified>
                        <lineGrossAmountSimplifiedHUF>2199</lineGrossAmountSimplifiedHUF>
                    </lineAmountsSimplified>
                </line>
            </invoiceLines>
            <invoiceSummary>
                <summarySimplified>
                    <vatRate>
                        <vatContent>0.2126</vatContent>
                    </vatRate>
                    <vatContentGrossAmount>21794</vatContentGrossAmount>
                    <vatContentGrossAmountHUF>21794</vatContentGrossAmountHUF>
                </summarySimplified>
                <summaryGrossData>
                    <invoiceGrossAmount>21794</invoiceGrossAmount>
                    <invoiceGrossAmountHUF>21794</invoiceGrossAmountHUF>
                </summaryGrossData>
            </invoiceSummary>
        </invoice>
    </invoiceMain>
</InvoiceData>
